Revit 2024 API
FabricationPart.InsulationArea Property
 The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double InsulationArea { get; }
Visual Basic
Public ReadOnly Property InsulationArea As Double
	Get
Visual C++
public:
property double InsulationArea {
	double get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace